soap/miniupnp/miniupnpd-1.0/seeds/07_WANIPC-AddPortMapping_2

<?xml version="1.0" encoding="UTF-8"?><s:Envelope s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" ><s:Body><u:AddPortMapping xmlns:u="urn:schemas-upnp-org:service:WANIPConnection:1"><NewRemoteHost>x\D?*O\E@cghs=1-</NewRemoteHost><NewExternalPort>31941</NewExternalPort><NewProtocol>UDP</NewProtocol><NewInternalPort>18345</NewInternalPort><NewInternalClient>oMw8fX({UG1,;!^h</NewInternalClient><NewEnabled>0</NewEnabled><NewPortMappingDescription>![4G6StFc|QJ:*U@</NewPortMappingDescription><NewLeaseDuration>3569401233</NewLeaseDuration></u:AddPortMapping></s:Body></s:Envelope>
